IDEA StatiCa Open Model
Element1D.EccentricityBeginX Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Local eccentricity X at the begin of Element1D
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double EccentricityBeginX { get; set; }
Public Property EccentricityBeginX As Double
	Get
	Set
public:
property double EccentricityBeginX {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
Element1D Class
IdeaRS.OpenModel.Model Namespace